//-----------------------------------------------------------------------------------
//Defina configurações para as fórmulas avançadas.
//-----------------------------------------------------------------------------------
CONFIG.TIME_HIERARCHY = CALENDARYEAR
CONFIG.GENERATE_UNBOOKED_DATA = OFF
//-----------------------------------------------------------------------------------
//O contexto de dados no qual as fórmulas serão executadas.
//-----------------------------------------------------------------------------------
MEMBERSET [d/Measures] = "VALOR"
MEMBERSET [d/Date] = ("202501","202502")
//-----------------------------------------------------------------------------------
//Cálculo e gravação de dados
//-----------------------------------------------------------------------------------
DATA([d/D_DS_FONTE]="CARGA_ARQUIVO") = RESULTLOOKUP() 