//-----------------------------------------------------------------------------------
//Defina configurações para as fórmulas avançadas.
//-----------------------------------------------------------------------------------
CONFIG.TIME_HIERARCHY = CALENDARYEAR
CONFIG.GENERATE_UNBOOKED_DATA = OFF
//-----------------------------------------------------------------------------------
//O contexto de dados no qual as fórmulas serão executadas.
//-----------------------------------------------------------------------------------
MEMBERSET [d/Measures] = "VALOR"
MEMBERSET [d/Date] = ("202503","202504","202505","202506","202507","202508","202509","202510","202511","202512")
//-----------------------------------------------------------------------------------
//Cálculo e gravação de dados
//-----------------------------------------------------------------------------------
FOREACH [d/Date]  
    DATA([d/D_DS_FONTE]="CARGA_ARQUIVO") = 
	RESULTLOOKUP([d/Date]=PREVIOUS(1, "MONTH")) 
ENDFOR